УТ114.CRM_Monolit/src/InformationRegisters/Mon_СоответствияНоменклатуры/Mon_СоответствияНоменклатуры.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>Mon_СоответствияНоменклатуры</name>
  <resources>
    <name>НоменклатураМонолит</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>55</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>Коэффициент</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
        <scale>4</scale>
      </numberQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>ТипМонолита</name>
    <type>
      <types>CatalogRef.Mon_ТипыМонолита</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Номенклатура</name>
    <type>
      <types>CatalogRef.Номенклатура</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Упаковка</name>
    <type>
      <types>CatalogRef.УпаковкиЕдиницыИзмерения</types>
    </type>
  </dimensions>
  <dimensions>
    <name>УпаковкаМонолит</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>55</length>
      </stringQualifiers>
    </type>
  </dimensions>
</mdclass:InformationRegister>

УТ114.CRM_Monolit/src/InformationRegisters/Mon_ВходящиеДанные/Mon_ВходящиеДанные.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>Mon_ВходящиеДанные</name>
  <resources>
    <name>ТекстОбмена</name>
    <type>
      <types>String</types>
    </type>
  </resources>
  <resources>
    <name>ДатаОбработки</name>
    <type>
      <types>Date</types>
    </type>
  </resources>
  <attributes>
    <name>Статус</name>
    <type>
      <types>EnumRef.Mon_СтатусыОбработкиСтрокиРегистра</types>
    </type>
  </attributes>
  <dimensions>
    <name>ШлюзОрганизации</name>
    <type>
      <types>CatalogRef.Mon_ШлюзыОрганизации</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ВидОбмена</name>
    <type>
      <types>EnumRef.Mon_ВидыОбменов</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ДатаЗагрузки</name>
    <type>
      <types>Date</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

УТ114.CRM_Monolit/src/Enums/Mon_ВидыОбменов/Mon_ВидыОбменов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>Mon_ВидыОбменов</name>
  <enumValues>
    <name>CRMOrder</name>
  </enumValues>
  <enumValues>
    <name>CRMWare</name>
  </enumValues>
  <enumValues>
    <name>CRMWhBalanceEx</name>
  </enumValues>
  <enumValues>
    <name>CRMWhBalanceExParts</name>
  </enumValues>
  <enumValues>
    <name>CRMSaldoEx</name>
  </enumValues>
  <enumValues>
    <name>CRMDespatchEx</name>
  </enumValues>
  <enumValues>
    <name>CRMOrderStatus</name>
  </enumValues>
  <enumValues>
    <name>CRMOrdRspEx</name>
  </enumValues>
  <enumValues>
    <name>CRMVendReceiptExParts</name>
  </enumValues>
  <enumValues>
    <name>CRMCreditCashOrder</name>
  </enumValues>
  <enumValues>
    <name>CRMClientAddressBanEx</name>
  </enumValues>
  <enumValues>
    <name>CRMDeliverySchedule</name>
  </enumValues>
</mdclass:Enum>

УТ114.CRM_Monolit/src/Catalogs/Номенклатура/Номенклатура.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog xmlns:mdclassExtension="http://g5.1c.ru/v8/dt/metadata/mdclass/extension" extendedConfigurationObject="fc59acc3-f1f7-4e3f-96da-e580f2c5a88f">
  <name>Номенклатура</name>
  <objectBelonging>Adopted</objectBelonging>
  <attributes extendedConfigurationObject="722c3d13-753d-4b4f-82b9-d41340f96d79">
    <name>Артикул</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <stringQualifiers>
          <length>50</length>
        </stringQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes extendedConfigurationObject="3d295926-ac21-4f62-b76e-64c929f1fc0e">
    <name>ЕдиницаИзмерения</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
</mdclass:Catalog>

УТ114.CRM_Monolit/src/InformationRegisters/Mon_СоответствияНоменклатуры/Forms/ФормаСопоставленияНоменклатуры/Module.bsl
&НаСервере
Процедура ПолучитьНовыйКлассификаторНоменклатурыНаСервере()
	
	Mon_Сервис.ПолучениеНоменклатурыПоТипамОбменов();
	
КонецПроцедуры

&НаКлиенте
Процедура ПолучитьНовыйКлассификаторНоменклатуры(Команда)
	
	Если НачалоДня(ДатаЗагрузкиКлассификатора) = НачалоДня(ТекущаяДата()) Тогда 
	
		Если Вопрос("Классификатор загружен недавно. Вы уверены, что его требуется обновить?",РежимДиалогаВопрос.ДаНет) = КодВозвратаДиалога.Нет Тогда
			
			Возврат;
			
		КонецЕсли;
		
	КонецЕсли;
	
	ПолучитьНовыйКлассификаторНоменклатурыНаСервере();
	
КонецПроцедуры

&НаСервере
Процедура ЗаписатьСопоставлениеНаСервере(Оповещение)
		
	Если СопоставлениеНоменклатуры.Количество() = 0 Тогда
		
		Оповещение = "Список сопоставления номенклатуры пуст! Запись прервана!";
		Возврат;				
		
	КонецЕсли;
	
	НачатьТранзакцию();
	
	Попытка
	   
		НаборЗаписей = РегистрыСведений.Mon_СоответствияНоменклатуры.СоздатьНаборЗаписей(); 
		НаборЗаписей.Отбор.ТипМонолита.Установить(ТипМонолита);
		НаборЗаписей.Записать();
		
		Для Каждого СтрокаТаблицы Из СопоставлениеНоменклатуры Цикл
			
			Если НЕ ЗначениеЗаполнено(СтрокаТаблицы.Номенклатура) 			Тогда Продолжить; КонецЕсли;			
			Если НЕ ЗначениеЗаполнено(СтрокаТаблицы.Упаковка) 				Тогда Продолжить; КонецЕсли;
			Если НЕ ЗначениеЗаполнено(СтрокаТаблицы.НоменклатураМонолит) 	Тогда Продолжить; КонецЕсли;		
			Если НЕ ЗначениеЗаполнено(СтрокаТаблицы.УпаковкаМонолит) 		Тогда Продолжить; КонецЕсли;			
			Если НЕ ЗначениеЗаполнено(СтрокаТаблицы.Коэффициент) 			Тогда Продолжить; КонецЕсли;
			
			НоваяЗапись = НаборЗаписей.Добавить();
			
			ЗаполнитьЗначенияСвойств(НоваяЗапись, СтрокаТаблицы);
							
		КонецЦикла;	
		
		НаборЗаписей.Записать(Истина);
		
				
	Исключение
		
		Оповещение = ОписаниеОшибки();
		ОтменитьТранзакцию();
		Возврат;
		
	КонецПопытки;

	ЗафиксироватьТранзакцию();	
		
КонецПроцедуры

&НаКлиенте
Процедура ЗаписатьСопоставление(Команда)
	
	Оповещение = "";
	
	ЗаписатьСопоставлениеНаСервере(Оповещение);
	
	Если НЕ Оповещение = "" Тогда
		
		Предупреждение(Оповещение);
		
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьСписокСопоставленияНаСервере()
	
	//Прочитать последний классификатор, соединить его с тем, что есть и загрузить в ТЗ.
	СписокНоменклатуры = Неопределено;
	
	ОбновлениеДатыАктуальностиНоменклатуры();
	
	Если ТекстОбменаXML = "" Тогда
		
		Возврат;
		
	КонецЕсли;
	
	Mon_Парсер.МонолитЗагрузка( ТекстОбменаXML, СписокНоменклатуры );
	
	СопоставлениеНоменклатуры.Очистить();
	
	Для Каждого Элемент Из СписокНоменклатуры Цикл
			
		НоваяСтрока = СопоставлениеНоменклатуры.Добавить();
		
		НоваяСтрока.ТипМонолита 					= ТипМонолита;
		НоваяСтрока.НоменклатураМонолит 			= Элемент.WareId;
		НоваяСтрока.НаименованиеНоменклатурыМонолит = Элемент.WareName;
		НоваяСтрока.УпаковкаМонолит 				= Элемент.UnitId;
		НоваяСтрока.Коэффициент 					= Элемент.Quantity;
		НоваяСтрока.НаименованиеУпаковкиМонолит 	= Элемент.UnitName;
		
	КонецЦикла;
	
	Запрос = Новый Запрос("ВЫБРАТЬ
		|	ВТ.ТипМонолита КАК ТипМонолита,
		|	ВТ.НоменклатураМонолит КАК НоменклатураМонолит,
		|	ВТ.НаименованиеНоменклатурыМонолит КАК НаименованиеНоменклатурыМонолит,
		|	ВТ.УпаковкаМонолит КАК УпаковкаМонолит,
		|	ВТ.Коэффициент КАК Коэффициент,
		|	ВТ.НаименованиеУпаковкиМонолит КАК НаименованиеУпаковкиМонолит
		|ПОМЕСТИТЬ ВТ_ИзРеестра
		|ИЗ
		|	&СопоставлениеНоменклатуры КАК ВТ
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ 
		|	ВТ_ИзРеестра.ТипМонолита КАК ТипМонолита,
		|	ВТ_ИзРеестра.НоменклатураМонолит КАК НоменклатураМонолит,
		|	ВТ_ИзРеестра.НаименованиеНоменклатурыМонолит КАК НаименованиеНоменклатурыМонолит,
		|	ВТ_ИзРеестра.УпаковкаМонолит КАК УпаковкаМонолит,
		|	ВТ_ИзРеестра.Коэффициент КАК Коэффициент,
		|	ВТ_ИзРеестра.НаименованиеУпаковкиМонолит КАК НаименованиеУпаковкиМонолит,
		|	Mon_СоответствияНоменклатуры.Номенклатура КАК Номенклатура,
		|	Mon_СоответствияНоменклатуры.Упаковка КАК Упаковка
		|ИЗ
		|	ВТ_ИзРеестра КАК ВТ_ИзРеестра
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.Mon_СоответствияНоменклатуры КАК Mon_СоответствияНоменклатуры
		|		ПО Mon_СоответствияНоменклатуры.ТипМонолита = ВТ_ИзРеестра.ТипМонолита
		|			И Mon_СоответствияНоменклатуры.НоменклатураМонолит = ВТ_ИзРеестра.НоменклатураМонолит
		|			И Mon_СоответствияНоменклатуры.УпаковкаМонолит = ВТ_ИзРеестра.УпаковкаМонолит
		|			И Mon_СоответствияНоменклатуры.Коэффициент = ВТ_ИзРеестра.Коэффициент");
	
	Запрос.УстановитьПараметр("СопоставлениеНоменклатуры", СопоставлениеНоменклатуры.Выгрузить());
	
	Результат = Запрос.Выполнить();
	
	ТЗ = Результат.Выгрузить();
	
	СопоставлениеНоменклатуры.Загрузить(ТЗ);
		
КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьСписокСопоставления(Команда)
	
	ЗаполнитьСписокСопоставленияНаСервере();
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	ОбновлениеДатыАктуальностиНоменклатуры();
	
КонецПроцедуры

&НаСервере
Процедура ОбновлениеДатыАктуальностиНоменклатуры()
	
	Если НЕ ЗначениеЗаполнено(ТипМонолита) Тогда
		
		Элементы.ДатаАктуальностиСписковНоменклатурыМонолит.Заголовок = "";		
		Возврат;
		
	КонецЕсли;
	
	
	Запрос = Новый Запрос;
	
	Запрос.Текст = "ВЫБРАТЬ ПЕРВЫЕ 1
	               |	Mon_ВходящиеДанные.ВидОбмена КАК ВидОбмена,
	               //|	Mon_ВходящиеДанные.ДатаОбработки КАК ДатаОбработки,
	               |	Mon_ВходящиеДанные.ДатаЗагрузки КАК ДатаЗагрузки,
	               |	Mon_ВходящиеДанные.ТекстОбмена КАК ТекстОбмена
	               |ИЗ
	               |	РегистрСведений.Mon_ВходящиеДанные КАК Mon_ВходящиеДанные
	               |ГДЕ
	               |	Mon_ВходящиеДанные.ВидОбмена = ЗНАЧЕНИЕ(Перечисление.Mon_ВидыОбменов.CRMWare)
	               |	И Mon_ВходящиеДанные.ШлюзОрганизации.ТипМонолита = &ТипМонолита
	               |
	               |УПОРЯДОЧИТЬ ПО
	               |	ДатаЗагрузки УБЫВ";
	Запрос.УстановитьПараметр("ТипМонолита", ТипМонолита);
	Результат = Запрос.Выполнить();
	Выборка = Результат.Выбрать();
	
	Если Выборка.Следующий() Тогда
		
		ДатаЗагрузкиКлассификатора = Выборка.ДатаЗагрузки;
		Элементы.ДатаАктуальностиСписковНоменклатурыМонолит.Заголовок = "Последний запрос выполнялся: " + Выборка.ДатаЗагрузки;	
		ТекстОбменаXML = Выборка.ТекстОбмена;
		
	Иначе
		
		ДатаЗагрузкиКлассификатора = '00010101';
		Элементы.ДатаАктуальностиСписковНоменклатурыМонолит.Заголовок = "По данному типу монолита запросов номенклатуры не было!";
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ТипМонолитаПриИзменении(Элемент)
	
	ОбновлениеДатыАктуальностиНоменклатуры();
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьИзАртикуловНоменклатурыНаСервере()
		
	//Прочитать последний классификатор, соединить его с тем, что есть и загрузить в ТЗ.
	СписокНоменклатуры = Неопределено;
	
	ОбновлениеДатыАктуальностиНоменклатуры();
	
	Если ТекстОбменаXML = "" Тогда
		
		Возврат;
		
	КонецЕсли;
	
	Mon_Парсер.МонолитЗагрузка( ТекстОбменаXML, СписокНоменклатуры );
	
	СопоставлениеНоменклатуры.Очистить();
	
	Для Каждого Элемент Из СписокНоменклатуры Цикл
			
		НоваяСтрока = СопоставлениеНоменклатуры.Добавить();
		
		НоваяСтрока.ТипМонолита 					= ТипМонолита;
		НоваяСтрока.НоменклатураМонолит 			= Элемент.WareId;
		НоваяСтрока.НаименованиеНоменклатурыМонолит = Элемент.WareName;
		НоваяСтрока.УпаковкаМонолит 				= Элемент.UnitId;
		НоваяСтрока.Коэффициент 					= Элемент.Quantity;
		НоваяСтрока.НаименованиеУпаковкиМонолит 	= Элемент.UnitName;
		
	КонецЦикла;
	
	Запрос = Новый Запрос("ВЫБРАТЬ
	                      |	ВТ.ТипМонолита КАК ТипМонолита,
	                      |	ВТ.НоменклатураМонолит КАК НоменклатураМонолит,
	                      |	ВТ.НаименованиеНоменклатурыМонолит КАК НаименованиеНоменклатурыМонолит,
	                      |	ВТ.УпаковкаМонолит КАК УпаковкаМонолит,
	                      |	ВТ.Коэффициент КАК Коэффициент,
	                      |	ВТ.НаименованиеУпаковкиМонолит КАК НаименованиеУпаковкиМонолит
	                      |ПОМЕСТИТЬ ВТ_ИзРеестра
	                      |ИЗ
	                      |	&СопоставлениеНоменклатуры КАК ВТ
	                      |;
	                      |
	                      |////////////////////////////////////////////////////////////////////////////////
	                      |ВЫБРАТЬ
	                      |	ВТ_ИзРеестра.ТипМонолита КАК ТипМонолита,
	                      |	ВТ_ИзРеестра.НоменклатураМонолит КАК НоменклатураМонолит,
	                      |	ВТ_ИзРеестра.НаименованиеНоменклатурыМонолит КАК НаименованиеНоменклатурыМонолит,
	                      |	ВТ_ИзРеестра.УпаковкаМонолит КАК УпаковкаМонолит,
	                      |	ВТ_ИзРеестра.Коэффициент КАК Коэффициент,
	                      |	ВТ_ИзРеестра.НаименованиеУпаковкиМонолит КАК НаименованиеУпаковкиМонолит,
	                      |	ВЫБОР
	                      |		КОГДА Mon_СоответствияНоменклатуры.Номенклатура ЕСТЬ NULL
	                      |			ТОГДА СправочникНоменклатура.Ссылка
	                      |		ИНАЧЕ Mon_СоответствияНоменклатуры.Номенклатура
	                      |	КОНЕЦ КАК Номенклатура,
	                      |	ВЫБОР
	                      |		КОГДА НЕ Mon_СоответствияНоменклатуры.Упаковка ЕСТЬ NULL
	                      |			ТОГДА Mon_СоответствияНоменклатуры.Упаковка
	                      |		КОГДА (ВТ_ИзРеестра.Коэффициент = 1 И ВТ_ИзРеестра.УпаковкаМонолит = ""ea"" ИЛИ ВТ_ИзРеестра.Коэффициент <> 1) И НЕ СправочникНоменклатура.ЕдиницаИзмерения ЕСТЬ NULL И СправочникНоменклатура.ЕдиницаИзмерения = &ЕдиницаИзмеренияКоличестваШтук
	                      |			ТОГДА СправочникНоменклатура.ЕдиницаИзмерения
						  |		КОГДА (ВТ_ИзРеестра.Коэффициент = 0.0333 И ВТ_ИзРеестра.УпаковкаМонолит = ""l"" ИЛИ ВТ_ИзРеестра.Коэффициент <> 0.0333) И НЕ СправочникНоменклатура.ЕдиницаИзмерения ЕСТЬ NULL И СправочникНоменклатура.ЕдиницаИзмерения = &ЕдиницаИзмеренияРазливнойПродукции
	                      |			ТОГДА СправочникНоменклатура.ЕдиницаИзмерения
	                      |	КОНЕЦ КАК Упаковка,
	                      |	СправочникНоменклатура.Ссылка КАК Ссылка,
	                      |	СправочникНоменклатура.ЕдиницаИзмерения КАК ЕдиницаИзмерения
	                      | 
	                      |ИЗ
	                      |	ВТ_ИзРеестра КАК ВТ_ИзРеестра
						  |			ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Номенклатура КАК СправочникНоменклатура
	                      |			ПО ВТ_ИзРеестра.НоменклатураМонолит = СправочникНоменклатура.Артикул
	                      |		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.Mon_СоответствияНоменклатуры КАК Mon_СоответствияНоменклатуры
	                      
	                      |		ПО (Mon_СоответствияНоменклатуры.ТипМонолита = ВТ_ИзРеестра.ТипМонолита)
	                      |			И (Mon_СоответствияНоменклатуры.НоменклатураМонолит = ВТ_ИзРеестра.НоменклатураМонолит)
	                      |			И (Mon_СоответствияНоменклатуры.УпаковкаМонолит = ВТ_ИзРеестра.УпаковкаМонолит)
	                      |			И (Mon_СоответствияНоменклатуры.Коэффициент = ВТ_ИзРеестра.Коэффициент)");
	
	Запрос.УстановитьПараметр("СопоставлениеНоменклатуры", 			СопоставлениеНоменклатуры.Выгрузить());
	Запрос.УстановитьПараметр("ЕдиницаИзмеренияКоличестваШтук", 	Константы.ЕдиницаИзмеренияКоличестваШтук.Получить());
	Запрос.УстановитьПараметр("ЕдиницаИзмеренияРазливнойПродукции", Константы.ЕдиницаИзмеренияРазливнойПродукции.Получить());
	Результат = Запрос.Выполнить();
	
	ТЗ = Результат.Выгрузить();
	
	СопоставлениеНоменклатуры.Загрузить(ТЗ);
	
КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьИзАртикуловНоменклатуры(Команда)
	ЗаполнитьИзАртикуловНоменклатурыНаСервере();

КонецПроцедуры
